16_rails_intro_review/app/controllers/brews_controller.rb

  def index
    @brews = Brew.all
---
SELECT "brews".* FROM "brews"

  def create
    @brew = Brew.new(brew_params)

    # is this brew valid?
    if @brew.valid?
      @brew.save
---
INSERT INTO "brews" ("blend_name", "origin", "notes", "strength", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["blend_name", "new name"], ["origin", "new origin"], ["notes", "some notes"], ["strength", 2], ["created_at", "2018-05-22 19:04:20.830626"], ["updated_at", "2018-05-22 19:04:20.830626"]]

  def update
    @brew.update(brew_params)
---
UPDATE "brews" SET "blend_name" = ?, "updated_at" = ? WHERE "brews"."id" = ?  [["blend_name", "updated name"], ["updated_at", "2018-05-22 19:15:51.357966"], ["id", 26]]

  def destroy
    @brew.destroy
---
DELETE FROM "brews" WHERE "brews"."id" = ?  [["id", 26]]

  def set_brew
    @brew = Brew.find(params[:id])
---
SELECT  "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]