14_rails_form_tag/app/controllers/cheeses_controller.rb

  def index
    @cheeses = Cheese.all
---
SELECT "cheeses".* FROM "cheeses"

  def create
    @cheese = Cheese.new(cheese_params)
    if @cheese.save
---
INSERT INTO "cheeses" ("name", "age", "smelliness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "camembert"], ["age", 3], ["smelliness", 8], ["created_at", "2018-05-21 15:55:41.012722"], ["updated_at", "2018-05-21 15:55:41.012722"]]

  def set_cheese
    @cheese = Cheese.find(params[:id])
---
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]